#+COLUMNS: %7TODO(To Do) %40ITEM(Task) %6CLOCKSUM(Clock)



* Real work

** TASK DP 200 predicate subject
*** Prepping for task
    CLOCK: [2019-08-03 za 08:52]--[2019-08-03 za 08:55] =>  0:08
    :PROPERTIES:
    :ORDERED:  t
    :END:

*** Looking for content
    CLOCK: [2019-08-05 ma 20:26]--[2019-08-05 ma 20:42] =>  0:16
    CLOCK: [2019-08-04 zo 22:04]--[2019-08-04 zo 22:08] =>  0:04
    CLOCK: [2019-08-03 za 09:22]--[2019-08-03 za 09:40] =>  0:18
    CLOCK: [2019-08-03 za 09:04]--[2019-08-03 za 09:18] =>  0:14

*** DPing 
    CLOCK: [2019-08-11 zo 00:58]--[2019-08-11 zo 02:22] =>  1:24
    CLOCK: [2019-08-10 za 23:54]--[2019-08-11 zo 00:35] =>  0:41
    CLOCK: [2019-08-10 za 23:23]--[2019-08-10 za 23:48] =>  0:25
    CLOCK: [2019-08-10 za 22:26]--[2019-08-10 za 22:37] =>  0:11
    CLOCK: [2019-08-10 za 22:02]--[2019-08-10 za 22:24] =>  0:22
    CLOCK: [2019-08-10 za 20:22]--[2019-08-10 za 21:22] =>  1:00
    CLOCK: [2019-08-10 za 17:41]--[2019-08-10 za 18:43] =>  1:02
    CLOCK: [2019-08-10 za 15:38]--[2019-08-10 za 15:48] =>  0:10
    CLOCK: [2019-08-10 za 15:18]--[2019-08-10 za 15:33] =>  0:15
    CLOCK: [2019-08-09 vr 22:35]--[2019-08-09 vr 22:48] =>  0:13
    CLOCK: [2019-08-09 vr 21:32]--[2019-08-09 vr 22:24] =>  0:52
    CLOCK: [2019-08-09 vr 21:20]--[2019-08-09 vr 21:30] =>  0:10
    CLOCK: [2019-08-09 vr 21:06]--[2019-08-09 vr 21:16] =>  0:10
    CLOCK: [2019-08-09 vr 20:24]--[2019-08-09 vr 20:45] =>  0:21
    CLOCK: [2019-08-09 vr 19:20]--[2019-08-09 vr 19:20] =>  0:00
    CLOCK: [2019-08-09 vr 18:25]--[2019-08-09 vr 18:55] =>  0:30
    CLOCK: [2019-08-09 vr 18:10]--[2019-08-09 vr 18:23] =>  0:13
    CLOCK: [2019-08-09 vr 17:48]--[2019-08-09 vr 18:08] =>  0:20
    CLOCK: [2019-08-09 vr 17:00]--[2019-08-09 vr 17:47] =>  0:47
    CLOCK: [2019-08-08 do 23:10]--[2019-08-08 do 23:10] =>  0:00
    CLOCK: [2019-08-08 do 22:57]--[2019-08-08 do 23:10] =>  0:13
    CLOCK: [2019-08-08 do 22:47]--[2019-08-08 do 22:55] =>  0:08
    CLOCK: [2019-08-08 do 22:18]--[2019-08-08 do 22:45] =>  0:27
    CLOCK: [2019-08-08 do 20:36]--[2019-08-08 do 22:02] =>  1:26
    CLOCK: [2019-08-08 do 20:00]--[2019-08-08 do 20:30] =>  0:31
    CLOCK: [2019-08-07 wo 22:46]--[2019-08-07 wo 23:10] =>  0:24
    CLOCK: [2019-08-07 wo 22:23]--[2019-08-07 wo 22:43] =>  0:20
    CLOCK: [2019-08-07 wo 21:36]--[2019-08-07 wo 22:20] =>  0:44
    CLOCK: [2019-08-07 wo 21:06]--[2019-08-07 wo 21:29] =>  0:23
    CLOCK: [2019-08-07 wo 20:51]--[2019-08-07 wo 21:04] =>  0:13
    CLOCK: [2019-08-07 wo 20:30]--[2019-08-07 wo 20:36] =>  0:06
    CLOCK: [2019-08-07 wo 19:52]--[2019-08-07 wo 20:27] =>  0:35
    CLOCK: [2019-08-06 di 22:20]--[2019-08-06 di 22:39] =>  0:19
    CLOCK: [2019-08-06 di 22:12]--[2019-08-06 di 22:19] =>  0:07
    CLOCK: [2019-08-06 di 21:56]--[2019-08-06 di 22:10] =>  0:14
    CLOCK: [2019-08-06 di 21:48]--[2019-08-06 di 21:52] =>  0:04
    CLOCK: [2019-08-06 di 21:34]--[2019-08-06 di 21:46] =>  0:12
    CLOCK: [2019-08-06 di 20:48]--[2019-08-06 di 21:31] =>  0:43
    CLOCK: [2019-08-06 di 20:17]--[2019-08-06 di 20:46] =>  0:29
    CLOCK: [2019-08-06 di 20:14]--[2019-08-06 di 20:16] =>  0:02
    CLOCK: [2019-08-06 di 19:58]--[2019-08-06 di 20:08] =>  0:10
    CLOCK: [2019-08-06 di 19:06]--[2019-08-06 di 19:55] =>  0:49
    CLOCK: [2019-08-06 di 19:02]--[2019-08-06 di 19:05] =>  0:03
    CLOCK: [2019-08-06 di 18:46]--[2019-08-06 di 19:01] =>  0:15
    CLOCK: [2019-08-06 di 18:44]--[2019-08-06 di 18:45] =>  0:01
    CLOCK: [2019-08-06 di 18:35]--[2019-08-06 di 18:43] =>  0:08
    CLOCK: [2019-08-06 di 18:24]--[2019-08-06 di 18:34] =>  0:10
    CLOCK: [2019-08-06 di 18:18]--[2019-08-06 di 18:21] =>  0:03
    CLOCK: [2019-08-06 di 18:11]--[2019-08-06 di 18:17] =>  0:06
    CLOCK: [2019-08-05 ma 23:10]--[2019-08-05 ma 23:21] =>  0:11
    CLOCK: [2019-08-05 ma 22:59]--[2019-08-05 ma 23:09] =>  0:10
    CLOCK: [2019-08-05 ma 22:49]--[2019-08-05 ma 22:58] =>  0:09
    CLOCK: [2019-08-05 ma 22:18]--[2019-08-05 ma 22:46] =>  0:28
    CLOCK: [2019-08-05 ma 21:38]--[2019-08-05 ma 22:15] =>  0:37
    CLOCK: [2019-08-05 ma 20:42]--[2019-08-05 ma 21:29] =>  0:47
    CLOCK: [2019-08-05 ma 20:19]--[2019-08-05 ma 20:26] =>  0:07
    CLOCK: [2019-08-05 ma 20:12]--[2019-08-05 ma 20:16] =>  0:04
    CLOCK: [2019-08-05 ma 19:37]--[2019-08-05 ma 20:10] =>  0:33
    CLOCK: [2019-08-05 ma 19:01]--[2019-08-05 ma 19:17] =>  0:16
    CLOCK: [2019-08-05 ma 18:45]--[2019-08-05 ma 18:58] =>  0:13
    CLOCK: [2019-08-05 ma 18:31]--[2019-08-05 ma 18:42] =>  0:11
    CLOCK: [2019-08-05 ma 18:29]--[2019-08-05 ma 18:31] =>  0:02
    CLOCK: [2019-08-04 zo 21:59]--[2019-08-04 zo 22:04] =>  0:05
    CLOCK: [2019-08-04 zo 19:30]--[2019-08-04 zo 21:54] =>  2:24
    CLOCK: [2019-08-04 zo 13:52]--[2019-08-04 zo 15:05] =>  1:13
    CLOCK: [2019-08-04 zo 11:48]--[2019-08-04 zo 12:27] =>  0:39
    CLOCK: [2019-08-04 zo 11:23]--[2019-08-04 zo 11:45] =>  0:22
    CLOCK: [2019-08-04 zo 11:15]--[2019-08-04 zo 11:17] =>  0:02
    CLOCK: [2019-08-04 zo 10:33]--[2019-08-04 zo 10:40] =>  0:07
    CLOCK: [2019-08-04 zo 10:20]--[2019-08-04 zo 10:29] =>  0:09
    CLOCK: [2019-08-04 zo 10:15]--[2019-08-04 zo 10:16] =>  0:01
    CLOCK: [2019-08-04 zo 09:35]--[2019-08-04 zo 10:10] =>  0:35
    CLOCK: [2019-08-04 zo 09:28]--[2019-08-04 zo 09:33] =>  0:05
    CLOCK: [2019-08-04 zo 08:57]--[2019-08-04 zo 09:00] =>  0:03
    CLOCK: [2019-08-04 zo 08:50]--[2019-08-04 zo 08:57] =>  0:07
    CLOCK: [2019-08-04 zo 08:21]--[2019-08-04 zo 08:43] =>  0:22
    CLOCK: [2019-08-03 za 09:47]--[2019-08-03 za 09:53] =>  0:06

** Wasting time while DPing Subject predicate task
*** Breaks
    CLOCK: [2019-08-11 zo 00:35]--[2019-08-11 zo 00:58] =>  0:23
    CLOCK: [2019-08-10 za 23:48]--[2019-08-10 za 23:54] =>  0:06
    CLOCK: [2019-08-10 za 22:37]--[2019-08-10 za 23:23] =>  0:46
    CLOCK: [2019-08-10 za 21:22]--[2019-08-10 za 22:02] =>  0:40
    CLOCK: [2019-08-09 vr 22:24]--[2019-08-09 vr 22:35] =>  0:11
    CLOCK: [2019-08-09 vr 20:45]--[2019-08-09 vr 21:06] =>  0:21
    CLOCK: [2019-08-09 vr 17:47]--[2019-08-09 vr 17:48] =>  0:01
    CLOCK: [2019-08-08 do 22:03]--[2019-08-08 do 22:18] =>  0:15
    CLOCK: [2019-08-06 di 20:08]--[2019-08-06 di 20:14] =>  0:06
    CLOCK: [2019-08-05 ma 21:29]--[2019-08-05 ma 21:38] =>  0:09
    CLOCK: [2019-08-04 zo 12:27]--[2019-08-04 zo 13:50] =>  1:23
    Lunch break
    CLOCK: [2019-08-04 zo 10:40]--[2019-08-04 zo 11:15] =>  0:35
    During break after 1.5 hrs.
    
**** Working on Org mode
     CLOCK: [2019-08-04 zo 09:04]--[2019-08-04 zo 09:24] =>  0:20
     CLOCK: [2019-08-04 zo 08:43]--[2019-08-04 zo 08:50] =>  0:07
     CLOCK: [2019-08-03 za 08:55]--[2019-08-03 za 09:04] =>  0:09
**** Dreaming
     CLOCK: [2019-08-10 za 22:24]--[2019-08-10 za 22:26] =>  0:02
     CLOCK: [2019-08-10 za 15:33]--[2019-08-10 za 15:38] =>  0:05
     CLOCK: [2019-08-09 vr 21:30]--[2019-08-09 vr 21:32] =>  0:02
     CLOCK: [2019-08-09 vr 21:16]--[2019-08-09 vr 21:20] =>  0:04
     CLOCK: [2019-08-09 vr 18:23]--[2019-08-09 vr 18:25] =>  0:02
     CLOCK: [2019-08-09 vr 18:08]--[2019-08-09 vr 18:10] =>  0:02
     CLOCK: [2019-08-08 do 22:55]--[2019-08-08 do 22:57] =>  0:02
     CLOCK: [2019-08-08 do 22:45]--[2019-08-08 do 22:47] =>  0:02
     CLOCK: [2019-08-07 wo 22:43]--[2019-08-07 wo 22:46] =>  0:03
     CLOCK: [2019-08-07 wo 22:21]--[2019-08-07 wo 22:23] =>  0:02
     CLOCK: [2019-08-07 wo 21:31]--[2019-08-07 wo 21:36] =>  0:05
     CLOCK: [2019-08-07 wo 21:29]--[2019-08-07 wo 21:31] =>  0:02
     CLOCK: [2019-08-07 wo 21:04]--[2019-08-07 wo 21:06] =>  0:02
     CLOCK: [2019-08-07 wo 20:27]--[2019-08-07 wo 20:30] =>  0:03
     CLOCK: [2019-08-06 di 22:19]--[2019-08-06 di 22:20] =>  0:01
     CLOCK: [2019-08-06 di 22:10]--[2019-08-06 di 22:12] =>  0:02
     CLOCK: [2019-08-06 di 21:46]--[2019-08-06 di 21:48] =>  0:02
     CLOCK: [2019-08-06 di 21:31]--[2019-08-06 di 21:34] =>  0:03
     CLOCK: [2019-08-06 di 20:46]--[2019-08-06 di 20:48] =>  0:02
     CLOCK: [2019-08-06 di 20:16]--[2019-08-06 di 20:17] =>  0:01
     CLOCK: [2019-08-06 di 19:55]--[2019-08-06 di 19:58] =>  0:03
     CLOCK: [2019-08-06 di 19:05]--[2019-08-06 di 19:06] =>  0:01
     CLOCK: [2019-08-06 di 19:01]--[2019-08-06 di 19:02] =>  0:01
     CLOCK: [2019-08-06 di 18:45]--[2019-08-06 di 18:46] =>  0:01
     CLOCK: [2019-08-06 di 18:43]--[2019-08-06 di 18:44] =>  0:01
     CLOCK: [2019-08-06 di 18:34]--[2019-08-06 di 18:35] =>  0:01
     CLOCK: [2019-08-06 di 18:21]--[2019-08-06 di 18:24] =>  0:03
     CLOCK: [2019-08-06 di 18:17]--[2019-08-06 di 18:18] =>  0:01
     CLOCK: [2019-08-05 ma 23:09]--[2019-08-05 ma 23:10] =>  0:01
     CLOCK: [2019-08-05 ma 22:58]--[2019-08-05 ma 22:59] =>  0:01
     CLOCK: [2019-08-05 ma 22:46]--[2019-08-05 ma 22:49] =>  0:03
     CLOCK: [2019-08-05 ma 22:15]--[2019-08-05 ma 22:18] =>  0:03
     CLOCK: [2019-08-05 ma 20:16]--[2019-08-05 ma 20:19] =>  0:03
     CLOCK: [2019-08-05 ma 20:10]--[2019-08-05 ma 20:12] =>  0:02
     CLOCK: [2019-08-05 ma 18:58]--[2019-08-05 ma 19:01] =>  0:03
     CLOCK: [2019-08-04 zo 21:54]--[2019-08-04 zo 21:59] =>  0:05
     CLOCK: [2019-08-04 zo 11:45]--[2019-08-04 zo 11:48] =>  0:03
     CLOCK: [2019-08-04 zo 11:17]--[2019-08-04 zo 11:23] =>  0:06
     CLOCK: [2019-08-04 zo 10:29]--[2019-08-04 zo 10:31] =>  0:02
     CLOCK: [2019-08-04 zo 10:16]--[2019-08-04 zo 10:20] =>  0:04
     CLOCK: [2019-08-04 zo 10:10]--[2019-08-04 zo 10:15] =>  0:05
     CLOCK: [2019-08-04 zo 09:33]--[2019-08-04 zo 09:35] =>  0:02
     CLOCK: [2019-08-04 zo 09:00]--[2019-08-04 zo 09:03] =>  0:03
     CLOCK: [2019-08-04 zo 08:57]--[2019-08-04 zo 08:57] =>  0:00
     CLOCK: [2019-08-03 za 09:40]--[2019-08-03 za 09:47] =>  0:07
     CLOCK: [2019-08-03 za 09:18]--[2019-08-03 za 09:22] =>  0:04

**** Random
     CLOCK: [2019-08-06 di 21:52]--[2019-08-06 di 21:56] =>  0:04
     CLOCK: [2019-08-05 ma 18:42]--[2019-08-05 ma 18:45] =>  0:03

** Sleeping 
   CLOCK: [2019-08-10 za 15:48]--[2019-08-10 za 17:41] =>  1:53
   CLOCK: [2019-08-07 wo 20:36]--[2019-08-07 wo 20:51] =>  0:15
   CLOCK: [2019-08-05 ma 19:17]--[2019-08-05 ma 19:37] =>  0:20
   CLOCK: [2019-08-03 za 09:53]--[2019-08-03 za 10:00] =>  0:07

** For STM     
   CLOCK: [2019-08-06 di 22:54]--[2019-08-06 di 23:52] =>  0:58
* Not absolute time wasters

** Figuring out time tracking
   CLOCK: [2019-08-06 di 22:41]--[2019-08-06 di 22:54] =>  0:13
   CLOCK: [2019-08-02 vr 19:00]--[2019-08-02 vr 21:18] =>  2:18
   CLOCK: [2019-08-01 do 22:36]--[2019-08-01 do 22:51] =>  0:15
   CLOCK: [2019-08-01 do 22:29]--[2019-08-01 do 22:33] =>  0:04

   This is nonsense and the shit I did is probably waste my time!

   CLOCK: [2019-08-01 do 22:18]--[2019-08-01 do 22:29] =>  0:11
   CLOCK: [2019-08-01 do 22:15]--[2019-08-01 do 22:16] =>  0:01

   CLOCK: [2019-08-01 do 21:55]--[2019-08-01 do 22:15] =>  0:20


* Time wasters

** Watching youtube
   CLOCK: [2019-08-01 do 22:16]--[2019-08-01 do 22:18] =>  0:02
** Playing with phone during work
   CLOCK: [2019-08-01 do 22:51]--[2019-08-01 do 23:14] =>  0:23

* Daily statistics

#+BEGIN: clocktable :maxlevel 3 :scope file :step week :tstart "<-8d>" :tend "<tomorrow>" :compact t

Weekly report starting on: [2019-08-03 za]
| Headline                                  |    Time |
|-------------------------------------------+---------|
| *Total time*                              | *10:21* |
|-------------------------------------------+---------|
| Real work                                 |   10:21 |
| \emsp TASK DP 200 predicate subject       |    6:59 |
| \emsp\emsp Prepping for task              |    0:03 |
| \emsp\emsp Looking for content            |    0:36 |
| \emsp\emsp DPing                          |    6:20 |
| \emsp Wasting time while DPing Subject... |    3:15 |
| \emsp\emsp Breaks                         |    3:15 |
| \emsp Sleeping                            |    0:07 |

Weekly report starting on: [2019-08-05 ma]
| Headline                                  |      Time |
|-------------------------------------------+-----------|
| *Total time*                              | *1d 5:11* |
|-------------------------------------------+-----------|
| Real work                                 |   1d 4:58 |
| \emsp TASK DP 200 predicate subject       |     21:10 |
| \emsp\emsp Looking for content            |      0:16 |
| \emsp\emsp DPing                          |     20:54 |
| \emsp Wasting time while DPing Subject... |      4:22 |
| \emsp\emsp Breaks                         |      4:22 |
| \emsp Sleeping                            |      2:28 |
| \emsp For STM                             |      0:58 |
| Not absolute time wasters                 |      0:13 |
| \emsp Figuring out time tracking          |      0:13 |
#+END:

* Shortcuts

1) C-c C-x C-i --> Clock in

2) C-c C-x C-x --> restart a clock

3) C-u C-c C-x C-x --> restart with menu

4) C-c C-x C-o --> Clock out

5) Dont' understand what `org-clock-in-drawer is`

6) C-c C-x C-j --> Jump to clocked task

7) C-c C-x C-q --> foget last clock

8) C-c C-x C-d -->  Display clocking info 

** Column view

1) C-c C-x C-c --> Show column view


2) as per this [[https://emacs.stackexchange.com/questions/35708/org-mode-how-to-generate-clock-report-for-hours-worked-each-day][org-clock-report]], we can change the lines of
   `org-clock-report` and then followed by text shown on top.

** Other

1) C-h v ~org-clock-mode-line-total~  is a variable used to determine what
clock is shown, agreegate for today or the total times. 

2) C-c C-x C-z ~org-resolve-clocks~ allows to go back in time to correct clocks. Look
[[https://stackoverflow.com/questions/11143645/emacs-org-mode-how-to-adjust-previous-clock-if-i-forget-to-clock-out][here]] for more info.

* Goal

To track how many hours you are spending on what with comments

To view statistics

- hours per day
- hours per week 
- per task, per all tasks except... 
- subsection adding t main heading
- Display org time on the task bar
- add 2 clocks one for current time and one for total time today in
  DP. :)

